import React from "react";
import { FcDocument } from "react-icons/fc";
import GuidDropdown from "../../../components/guidDropdown/GuidDropdown";

export default function SiteGuide() {
    const guid = [
        {
            title : "قوانین",
            body : "توجه داشته باشید کلیه اصول و رویه‏‌های منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر شما از سایت به معنی پذیرش هرگونه تغییر است."
        },
        {
            title : "تست ۱",
            body : "تستی",
        }
    ]
  return (
    <div className="px-5">
      <div className=" py-6">
        <p className="text-xl font-extrabold">راهنمای سایت </p>
      </div>
      <FcDocument className=" text-4xl" />
      <div className="">
        <p className="font-bold text-lg my-3">
          شرایط و قوانین استفاده از سرویس‌ها و خدمات 
        </p>
        <p className="text-gray-600 justify-items-stretch">
          کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و
          برنامه‌‏های کاربردی  به دقت ملاحظه فرمایید.ورود کاربران به
          وب‏‌سایت  هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی،
          ویدئوهای رسانه تصویری  و سایر خدمات ارائه شده  
          به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از
          سرویس‌‏ها و خدمات  است. توجه داشته باشید که ثبت سفارش نیز در
          هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین  از سوی
          کاربر است. لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه
          توافق‏‌های قبلی محسوب می‏‌شود.
        </p>
      </div>

      {guid.map(item => <GuidDropdown {...item}/>)}
    </div>
  );
}
